#### DuctFittingAndAccessoryPressureDropData Members

---

|  |
| --- |
| DuctFittingAndAccessoryPressureDropData Class   Methods   Properties   See Also |

The  DuctFittingAndAccessoryPressureDropData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DuctFittingAndAccessoryPressureDropData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetDuctFittingAndAccessoryData | Returns the fitting and accessory information. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetPresureDropItems | Returns the pressure drop items. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetDefaultEntity | Stores the default entity in the data. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CalculationType | The calculation type, a bitmask of FittingAndAccessoryCalculationType. |
| Public property | IsCurrentEntityValid | True if the current settings stored in the entity is valid. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DuctFittingAndAccessoryPressureDropData Class

Autodesk.Revit.DB.Mechanical Namespace